In [35]:
import pandas as pd

df = pd.read_csv("csv_files/expanded_employee_data.csv")
df.head()

,EmployeeID,Name,Age,Department,Position,Salary,JoiningDate,Location,Experience,Performance,Gender,LeavesTaken,ProjectsHandled,RemoteWork
0,1,Employee_1,50,Finance,Executive,72254,2010-01-31,London,29,Good,Other,29,7,Yes
1,2,Employee_2,36,Finance,Assistant,87362,2010-02-28,Toronto,3,Excellent,Female,3,7,No
2,3,Employee_3,29,Finance,Manager,60128,2010-03-31,Sydney,34,Excellent,Male,1,4,Yes
3,4,Employee_4,42,HR,Manager,99383,2010-04-30,Berlin,27,Average,Female,19,13,Yes
4,5,Employee_5,40,HR,Engineer,105545,2010-05-31,New York,13,Average,Other,15,14,No

In [30]:
# Easy Tasks
# Load the dataset into pandas and display the first 10 rows.
# Check the shape (number of rows and columns).
# Get the list of column names.
# Find the average salary of all employees.
# Count how many employees are in each department.

clone_df = df.copy()
clone_df.head(10)
clone_df.shape
clone_df.columns.to_list()
# clone_df["Salary"].mean()
clone_df.loc[:,"Salary"].mean().round()
clone_df.groupby(by = "Department")["EmployeeID"].count()
clone_df["Department"].value_counts()

Department
Sales        60
Finance      59
Marketing    54
HR           48
Support      40
IT           39
Name: count, dtype: int64

In [69]:
# ðŸŸ¡ Medium Tasks
# Find the maximum bonus and the employeeâ€™s name who received it.
# Calculate the average experience of employees in the "IT" department.
# Create a new column called Total Compensation = Salary + Bonus.
# Get the top 5 highest paid employees (based on Total Compensation).
# Find how many employees have more than 5 years of experience.
clone_df = df.copy()

maximum = clone_df["Salary"].max()
clone_df.loc[clone_df["Salary"] == maximum]
# clone_df.query("Salary == 'maximum'")
clone_df.groupby("Department")